/**
 * Пакет, содержащий классы конфигурации для сервиса скраппинга.<br>
 * Этот пакет включает в себя классы, которые предназначены для
 * управления конфигурационными параметрами приложения, такими как
 * токены доступа и учетные данные для сторонних API.<br>
 * Основные функции:<br>
 * - Хранение и валидация конфигурационных параметров приложения через
 *   аннотации Spring и Jakarta Bean Validation.<br>
 * - Обеспечение удобного доступа к настройкам, необходимым для
 *   функционирования сервиса скраппинга.<br>
 * Конфигурационные классы используют аннотации Spring для
 * интеграции с механизмом управления свойствами приложения.
 */
package backend.academy.scrapper.config;
